# SQL Interview Questions - Lab

## Introduction

In this lab, we'll test our SQL skills against some real-world interview questions from major companies!

## Objectives

You will be able to:

* Write SQL queries to filter and order results
* Decide and perform whichever type of join is best for retrieving desired data
* Write subqueries to decompose complex queries

## Getting Started

In this lab, we'll see four different interview questions that test your SQL knowledge. We didn't write these questions -- instead, we found them out in the real-world. These are questions that have been used in the past by major technology companies such as Facebook, Amazon, and Twitter. Our goal here isn't to memorize the questions or anything like that -- after all, it's extremely unlikely that these questions are still in use, now that they've become publicly available on the interwebs. Instead, our goal is to treat these questions as if they are the real thing, and give us some insight into the types of questions we'll need to be able to answer in order pass an interview involving SQL. 

If these questions seem hard to you, don't sweat it, they're supposed to be tough! These are meant to help you identify any areas of knowledge where you still need to grow! Use these questions as a way to see where your SQL knowledge is strong, and where it's a bit weak. Then, go study and **practice** in the areas where you still need work!

### A Note on Answering These Questions

Since these are interview questions, they'll almost always be posed as hypotheticals. This means that you won't have a real database to work with and test your code on. This also means that there are multiple different solutions to any given problem listed here. Be sure to doublecheck the code you write for bugs and errors. It's much harder to write bug-free code when you aren't able to test it against a database!

If these questions seem hard, that's normal. These are real questions that have been reported to online forums from job seekers at major companies. Obviously, it's unlikely that they're still in use at these companies, but they still represent a great way for us to test our skills against the kinds of questions we can expect to be asked in an interview!

## Question 1

From Facebook:

Assume we have a table of employee information, which includes salary information. Write a query to find the names and salaries of the top 5 highest paid employees, in descending order.

In [2]:
import sqlite3 as sql3
cnx = sql3.connect("q1.db")
cur = cnx.cursor()
import pandas as pd
conn = sql3.connect("q2.db")
cursor = conn.cursor()

In [3]:
name_and_pay = [{'name':'John','pay':60000},
          {'name':'Miriam','pay':85000},
          {'name':'Jennifer','pay':42000},
          {'name':'Lucas','pay':51000},
          {'name':'Dwayne','pay':38000},
          {'name':'Stanley','pay':60500}]

In [22]:
cursor.execute("""CREATE TABLE employeePay (
                                id INTEGER PRIMARY KEY,
                                name TEXT,
                                pay INTEGER)""")

OperationalError: table employeePay already exists

In [24]:
for name in name_and_pay:
    cursor.execute("""INSERT INTO employeePay (name , pay) 
                  VALUES ('{}','{}');
            """.format(name_and_pay['name'],name_and_pay['pay']))

TypeError: list indices must be integers or slices, not str

In [23]:
records = [{'author_name':'author_1','book_name':'book_1'},
          {'author_name':'author_1','book_name':'book_2'},
          {'author_name':'author_2','book_name':'book_3'},
          {'author_name':'author_2','book_name':'book_4'},
          {'author_name':'author_3','book_name':'book_5'},
          {'author_name':'author_3','book_name':'book_6'}]
for record in records:
    cur.execute("""INSERT INTO authors (author_name , book_name) 
                  VALUES ('{}','{}');
            """.format(record['author_name'],record['book_name']))

OperationalError: no such column: book_1

In [6]:
records = [{'book_name':'book_1','copies_sold':10000},
          {'book_name':'book_2','copies_sold':2575},
          {'book_name':'book_3','copies_sold':60000},
          {'book_name':'book_4','copies_sold':98000},
          {'book_name':'book_5','copies_sold':5250},
          {'book_name':'book_6','copies_sold':19775}]
for record in records:
    cur.execute("""INSERT INTO books (book_name , copies_sold) 
                  VALUES ('{}','{}');
            """.format(record['book_name'],record['copies_sold']))

In [5]:
cur.execute("""SELECT * FROM books;""").fetchall()

[]

In [28]:
q = """SELECT name, salary
        FROM table
        ORDER BY salary DESC
        LIMIT 5"""

## Question 2

From Amazon:

Assume we have two SQL tables: `authors` and `books`. The authors table has a few million rows, and looks like this: 

| author_name | book_name |
|:-----------:|:---------:|
|   author_1  |   book_1  |
|   author_1  |   book_2  |
|   author_2  |   book_3  |
|   author_2  |   book_4  |
|   author_2  |   book_5  |
|   author_3  |   book_6  |

The books dataset also has a few million rows, and looks like this:

| book_name | copies_sold |
|:---------:|:-----------:|
|   book_1  |    10000    |
|   book_2  |     2575    |
|   book_3  |    60000    |
|   book_4  |    98000    |
|   book_5  |     5250    |
|   book_6  |    19775    |

Write an SQL query that shows the top 3 authors who sold the most total books.

In [12]:
q = """SELECT author, total_books_sold
        FROM authors
        JOIN books
            USING(book_name)
            GROUP BY author
            SUM(copies_sold) as total_books_sold
            ORDER BY total_books_sold DESC
            LIMIT 3"""
pd.read_sql(q,cnx)

DatabaseError: Execution failed on sql 'SELECT author, total_books_sold
        FROM authors
        JOIN books
            USING(book_name)
            GROUP BY author
            SUM(copies_sold) as total_books_sold
            ORDER BY total_books_sold DESC
            LIMIT 3': near "SUM": syntax error

## Question 3

From Amazon:

Assume you have two tables, `customers` and `orders`. Write a SQL query to select all customers who purchased at least 2 items on two separate days.

In [ ]:
q="""SELECT c.customer, COUNT(DISTINCT o.orderDate) as qtyOrderDates
        FROM (SELECT c.customer, o.quantity FROM customers AS c
            JOIN orders AS o ON c.orderNumber = o.OrderNumber
            WHERE o.quantity >1)
        WHERE qtyOrderDates >1;
            """

## Question 4

From Twitter:

A company uses 2 data tables, `Employee` and `Department`, to store data about its employees and departments. 

Table Name: Employee   
Attributes:   
ID Integer,   
NAME String,   
SALARY Integer,   
DEPT_ID Integer   

Table Name: Department   
Attributes:   
DEPT_ID Integer,   
NAME String,   
LOCATION String   

Write a query to print the respective Department Name and number of employees for all departments in the Department table (even unstaffed ones). 

Sort your result in descending order of employees per department; if two or more departments have the same number of employees, then sort those departments alphabetically by Department Name.

In [ ]:
# Your code here

## Summary

In this lab, we tested our knowledge of SQL queries against some real-world interview questions!